
/*
Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
a = 5; b = 7 -> max = 7
a = 2 b = 10 -> max = 10
a = -9 b = -3 -> max = -3
==============================================================================================

Console.Write("Напишите 1 число");
int numb1 = int.Parse(Console.ReadLine()!);
Console.Write("Напишите 2 число");
int numb2 = int.Parse(Console.ReadLine()!);

if (numb1 < numb2)
{
        Console.WriteLine(numb2 + " больше " + numb1);
}
else{
     Console.WriteLine(numb1 + " больше " + numb2);
}*/

//==============================================================================================
/*
 Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
2, 3, 7 -> 7
44 5 78 -> 78
22 3 9 -> 22
*/
/* ===========================================================================================================================

Console.Write("Напишите 1 число");
int numb1 = int.Parse(Console.ReadLine()!);
Console.Write("Напишите 2 число");
int numb2 = int.Parse(Console.ReadLine()!);
Console.Write("Напишите 3 число");
int numb3 = int.Parse(Console.ReadLine()!);

if (numb1 < numb2)
{
    if (numb2 > numb3)
    {
        Console.WriteLine(numb2 + ("Максимальное число"));
    }
    else{
         Console.WriteLine(numb3 + ("Максимальное число"));
    }
}
else{
  if (numb1 > numb3)
  {
    Console.WriteLine(numb1 + (" Максимальное число"));
  }
  else{
     Console.WriteLine(numb3 + (" Максимальное число"));
  }
}

=======================================================================================================================================*/ 


/*=====================================================================================================================
Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
4 -> да
-3 -> нет
7 -> нет
====================================================================================================================*/

/*=====================================================================================================================

Console.Write("Напишите  число");
int numb = int.Parse(Console.ReadLine()!);
int num = numb % 2;
if (num == 0)
{
    Console.Write("четное");
}
else {
    Console.Write("не четное");
}  

====================================================================================================================*/

/*=====================================================================================================================
Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
5 -> 2, 4
8 -> 2, 4, 6, 8
====================================================================================================================*/

/*=====================================================================================================================

Console.Write("Напишите  число");
int numb = int.Parse(Console.ReadLine()!);
int num = 1;
while (num <= numb)
{
    if (num % 2 == 0)
    {
         Console.WriteLine(num);
         num += 1;
    }
    else
    {
        num +=1;
    }
}

====================================================================================================================*/